# Poll Question
## how to resample a time series dataframe 'df' to the monthly mean in pandas

## Create Sample data

In [127]:
import pandas as pd

In [128]:
# sample dataframe created
data_dict = {'Name': ['Alice', 'Bob', 'Charlie', 'None'], 
'Age': [25, -1, 30, 22], # Negative data is valid
'Income': [55000, None, 48000, 62000]} # missing income

In [129]:
df_dirty = pd.DataFrame(data_dict)

In [130]:
df_dirty.head()

      Name  Age   Income
0    Alice   25  55000.0
1      Bob   -1      NaN
2  Charlie   30  48000.0
3     None   22  62000.0

In [131]:
 df_kaduna = pd.read_csv('/Users/strangemax/Library/Mobile Documents/iCloud~AsheKube~Carnets/Documents/Alt/alt/pablo data/kaduna_biodata.csv')

In [132]:
df_kaduna.head()

,Date,Age,Salary,Amount_in_Bank,Tax_Paid,Credit_Score,Marital_Status,Gender,Educational_Status,Height,Weight,Years_in_Job,State,LGAs
0,2016-01-01 00:00:00.000000000,37.0,122685.0,543553,91534.0,0.275540,Divorced,Male,Graduate,6.503524,86.106637,15,Kaduna,Makarfi
1,2016-01-01 00:42:03.769237692,42.0,1900407.0,843291,57100.0,7.704523,NaN,Male,Undergraduate,5.620648,73.578475,23,Kaduna,Lere
2,2016-01-01 01:24:07.538475384,60.0,1186260.0,253582,32845.0,9.345433,Single,Prefer not to say,Unknown,5.859873,80.320222,15,Kaduna,Birnin Gwari
3,2016-01-01 02:06:11.307713077,62.0,718343.0,411517,54669.0,2.310399,Married,Prefer not to say,Undergraduate,5.598025,103.596193,26,Kaduna,Kudan
4,2016-01-01 02:48:15.076950769,25.0,1918421.0,163754,43163.0,7.157165,Divorced,Prefer not to say,Undergraduate,5.866902,105.532552,2,Kaduna,Zaria

## data transformation

In [133]:
#data cleaning 
import csv

In [134]:
# Create a CSV file with only the required attributes: with open(mailbox.csv',
with open('mailbox.csv', 'w') as outputfile:
writer = csv.writer (outputfile)
writer.writerow(['subject', 'from', 'date', 'to', 'label', 'thread'])
for message in mbox:
    writer.writerow{[
        message['subject'], message['from'], message['date'),
        message['to'], message("X-Gnail-Labels'], message [*X-GN-THRID']
    ]}

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (3213510540.py, line 7)

In [ ]:
# Original data
data_dates = {'Date': ['2021-5-10', '05/11/2021', '2021.09.12', '10-05-2021']}
df_inconsistent = pd.DataFrame(data_dates)
time_format = ['%Y-%m-%d', '%d/%m/%Y', '%m/%d/%Y', '%Y.%m.%d', '%d-%m-%Y']

def parse_date(date_str):
    for ft in time_format:
        try:
            return datetime.strptime(date_str, ft)
        except ValueError:
            continue
    return pd.NaT

df_inconsistent['Date'] = df_inconsistent['Date'].apply(parse_date)

print(df_inconsistent)

        Date
0 2021-05-10
1 2021-11-05
2 2021-09-12
3 2021-05-10

In [ ]:
data_dates = {'Date': ['2021-5-10', '05/11/2021', '2021.09.12', '10-05-2021']}
df_inconsistent = pd.DataFrame(data_dates)

In [ ]:
df_inconsistent

         Date
0   2021-5-10
1  05/11/2021
2  2021.09.12
3  10-05-2021

In [ ]:
df_inconsistent['Date'] = pd.to_datetime(df_inconsistent['Date'], errors='coerce', yearfirst= True)

In [ ]:
df_inconsistent

        Date
0 2021-05-10
1        NaT
2        NaT
3        NaT

In [ ]:
df_inconsistent_test_1 = df_inconsistent.copy() # create copy to test datetime module

In [ ]:
df_inconsistent_test_1

          Date
0    2021-5-10
1   05/11/2021
2  2021.05.12,
3   10-05-2021

In [ ]:
df_inconsistent_test_1['Date'] = pd.to_datetime(df_inconsistent_test_1['Date'], errors='coerce', yearfirst= True)
df_inconsistent_test_1

        Date
0 2021-05-10
1        NaT
2        NaT
3        NaT

## Dealing with duplicates

In [200]:
## create datafraame with duplicate data
dup_data = {'Name': ['Femi', 'John', 'Tunde', 'Mark', 'Femi'],
            'Age': [31, 34, 26, 25, 31],
            'Location': ['lagos', 'abuja', 'kaduna', 'jos', 'lagos']}
df_dup = pd.DataFrame(dup_data)
df_dup

    Name  Age Location
0   Femi   31    lagos
1   John   34    abuja
2  Tunde   26   kaduna
3   Mark   25      jos
4   Femi   31    lagos

In [196]:
df_dup

    Name  Age Location
0   Femi   31    lagos
1   John   34    abuja
2  Tunde   26   kaduna
3   Mark   25      jos

In [203]:
## remove duplicate from dataframe
df_dup.drop_duplicates(inplace=True)
print('\n Data with duplicate removed')
df_dup

 Data with duplicate removed

    Name  Age Location
0   Femi   31    lagos
1   John   34    abuja
2  Tunde   26   kaduna
3   Mark   25      jos

# isolating via boolean series

In [190]:
# creating a boolean series
logic_series = [False, True, False, False]
logic_series = pd.Series(logic_series)
logic_series

0    False
1     True
2    False
3    False
dtype: bool

In [204]:
# check dataframe
df_dup

    Name  Age Location
0   Femi   31    lagos
1   John   34    abuja
2  Tunde   26   kaduna
3   Mark   25      jos

In [205]:
# test series with dataframe
df_dup[logic_series]

   Name  Age Location
1  John   34    abuja

In [230]:
df_dup_range = df_dup.loc[logic_series[range(0, 4, 1)]]
df_dup_range

   Name  Age Location
1  John   34    abuja

In [ ]:
# check index of logic_series
logic_series.index

RangeIndex(start=0, stop=4, step=1)

In [210]:
#check index of dataframe
df_dup.index

Index([0, 1, 2, 3], dtype='int64')

# data filtering : select roles that meet certain condition

In [139]:
df_biodata = pd.read_csv('/Users/strangemax/Library/Mobile Documents/iCloud~AsheKube~Carnets/Documents/Alt/alt/pablo data/biodata.csv')

In [146]:
df_biodata_real = pd.read_csv('/Users/strangemax/Library/Mobile Documents/iCloud~AsheKube~Carnets/Documents/Alt/alt/pablo data/biodata_real.csv')

In [140]:
df_biodata.head()

   Age  Salary             Gender Marital Status  Years of Experience
0   38  108411             Female        Married                    1
1   32   98869  Prefer Not to Say        Married                   13
2   65  127083  Prefer Not to Say         Single                    4
3   51   27428               Male       Divorced                    1
4   61   14142  Prefer Not to Say         Single                   19

In [148]:
df_biodata_real.head()

,Age,Salary,Amount_in_Bank,Tax_Paid,Credit_Score,Marital_Status,Gender,Educational_Status,Height,Weight,Years_in_Job
0,29,891210.0,296192,53854,1.013933,Single,Female,Undergraduate,5.275324,71.896771,4
1,63,NaN,281808,45701,7.606902,Single,Male,Unknown,5.359243,91.057613,43
2,22,1989622.0,955810,87648,0.773851,Divorced,Male,Unknown,6.476773,82.515343,0
3,64,NaN,353869,17184,1.043921,Married,Male,Graduate,6.242367,45.025975,19
4,58,NaN,712549,28857,4.640069,Divorced,Female,Undergraduate,6.179773,41.135096,20

In [150]:
df_biodata_real.isnull().sum()

Age                       0
Salary                10000
Amount_in_Bank            0
Tax_Paid                  0
Credit_Score              0
Marital_Status            0
Gender                    0
Educational_Status     5000
Height                    0
Weight                 7000
Years_in_Job              0
dtype: int64

In [141]:
#isolate data with age being a certain age limit
age_limit = 18

In [163]:
# try reindexing into a different dataframe
df_too_young_reindex = df[df_biodata['Years of Experience'] > (df_biodata['Age'] - age_limit)]

/var/folders/mj/cp5knww57qdcjpty7h3hz1w40000gn/T/ipykernel_90987/2496338813.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_too_young_reindex = df[df_biodata['Years of Experience'] > (df_biodata['Age'] - age_limit)]

In [164]:
df_too_young_reindex

Empty DataFrame
Columns: [Date]
Index: []

In [246]:
# filter based on years of experience being realistic to Age
df_invalid_bio = df_biodata[df_biodata['Years of Experience'] > (df_biodata['Age'] - age_limit)]

In [247]:
# create boolean series for filtering
key_object = df_biodata['Years of Experience'] > (df_biodata['Age'] - age_limit)
key_object.head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [248]:
# filter using created boolean series
df_invalid_bio_key = df_biodata[key_object]
df_invalid_bio_key.head()

    Age  Salary  Gender Marital Status  Years of Experience
8    28  193555    Male         Single                   21
10   39  183198  Female        Married                   24
12   28  145575  Female         Single                   14
19   25  178388  Female       Divorced                   18
22   36   14802  Female        Married                   22

In [249]:
df_invalid_bio.head()

    Age  Salary  Gender Marital Status  Years of Experience
8    28  193555    Male         Single                   21
10   39  183198  Female        Married                   24
12   28  145575  Female         Single                   14
19   25  178388  Female       Divorced                   18
22   36   14802  Female        Married                   22

In [250]:
df_invalid_bio.shape

(27043, 5)

In [251]:
df_invalid_bio.head()

    Age  Salary  Gender Marital Status  Years of Experience
8    28  193555    Male         Single                   21
10   39  183198  Female        Married                   24
12   28  145575  Female         Single                   14
19   25  178388  Female       Divorced                   18
22   36   14802  Female        Married                   22

In [252]:
# check the datatype of age column
df_invalid_bio['Age'].dtype
# to change the datatype to string
# df_valid_bio['Age'].astype('string')

dtype('int64')

In [254]:
# use bitwise NOT operator to reverse the data
df_valid_bio = df_biodata[~(df_biodata['Years of Experience'] > (df_biodata['Age'] - age_limit))]
df_valid_bio.shape

(72957, 5)

In [245]:
df_valid_bio.head()

   Age  Salary             Gender Marital Status  Years of Experience
0   38  108411             Female        Married                    1
1   32   98869  Prefer Not to Say        Married                   13
2   65  127083  Prefer Not to Say         Single                    4
3   51   27428               Male       Divorced                    1
4   61   14142  Prefer Not to Say         Single                   19

# time series dataframe

In [255]:
pip install kaggle

Collecting kaggle
  Downloading kaggle-1.6.17.tar.gz (82 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 82.7/82.7 kB 451.1 kB/s eta 0:00:00a 0:00:01
  Preparing metadata (setup.py) ... done
Requirement already satisfied: six>=1.10 in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (1.16.0)
Requirement already satisfied: certifi>=2023.7.22 in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (2024.2.2)
Requirement already satisfied: python-dateutil in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (2.8.2)
Requirement already satisfied: requests in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (2.31.0)
Requirement already satisfied: tqdm in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (4.65.0)
Requirement already satisfied: python-slugify in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (5.0.2)
Requirement already satisfied: urllib3 in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (2.0.7)
Requirement already satisfied: bleach in /opt/anaconda3/lib/python3.11/site-packages (from kaggle) (4.1.0)
Requirement already satisfied: packaging in /opt/anaconda3/lib/python3.11/site-packages (from bleach->kaggle) (23.1)
Requirement already satisfied: webencodings in /opt/anaconda3/lib/python3.11/site-packages (from bleach->kaggle) (0.5.1)
Requirement already satisfied: text-unidecode>=1.3 in /opt/anaconda3/lib/python3.11/site-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/anaconda3/lib/python3.11/site-packages (from requests->kaggle) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in /opt/anaconda3/lib/python3.11/site-packages (from requests->kaggle) (3.4)
Building wheels for collected packages: kaggle
  Building wheel for kaggle (setup.py) ... done
  Created wheel for kaggle: filename=kaggle-1.6.17-py3-none-any.whl size=105786 sha256=14093e0b0d2eece48fc0c1bec5f401ae47971c7efce1ab52ae5823879c814128
  Stored in directory: /Users/strangemax/Library/Caches/pip/wheels/ff/55/fb/b27a466be754d2a06ffe0e37b248d844f090a63b51becea85d
Successfully built kaggle
Installing collected packages: kaggle
Successfully installed kaggle-1.6.17
Note: you may need to restart the kernel to use updated packages.

In [257]:
kaggle datasets list -s ['time series health']

SyntaxError: invalid syntax (1460287880.py, line 1)